IDEA Open Model
ReinfFabric.DiameterX Property
 Bar diameter - direction X
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public double DiameterX { get; set; }
Public Property DiameterX As Double
	Get
	Set
public:
property double DiameterX {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
ReinfFabric Class
IdeaRS.OpenModel.Detail Namespace